spec/fixtures/files/stripe_api/webhooks/payment_intents/successful_status_with_booking_id.json

{ 
  "id":"evt_1FVH26ESypPNvvdYDO0icPV1",
  "object":"event",
  "api_version":"2019-09-09",
  "created":1571488066,
  "data":{ 
    "object":{ 
      "id":"pi_1FVH25ESypPNvvdYGDo6X9H1",
      "object":"payment_intent",
      "amount":90000,
      "amount_capturable":0,
      "amount_received":90000,
      "application":null,
      "application_fee_amount":null,
      "canceled_at":null,
      "cancellation_reason":null,
      "capture_method":"automatic",
      "charges":{ 
        "object":"list",
        "data":[ 
          { 
            "id":"ch_1FVH25ESypPNvvdY3B0eW0tv",
            "object":"charge",
            "amount":90000,
            "amount_refunded":0,
            "application":null,
            "application_fee":null,
            "application_fee_amount":null,
            "balance_transaction":"txn_1FVH26ESypPNvvdY5ToQVPwS",
            "billing_details":{ 
              "address":{ 
                "city":null,
                "country":null,
                "line1":null,
                "line2":null,
                "postal_code":"42424",
                "state":null
              },
              "email":null,
              "name":null,
              "phone":null
            },
            "captured":true,
            "created":1571488065,
            "currency":"gbp",
            "customer":"cus_G1JcXAGYmhraKp",
            "description":null,
            "destination":null,
            "dispute":null,
            "failure_code":null,
            "failure_message":null,
            "fraud_details":{ 

            },
            "invoice":null,
            "livemode":false,
            "metadata":{ 
              "booking_id":"2f2a2255-8b43-4574-9d33-b7f56d624026"
            },
            "on_behalf_of":null,
            "order":null,
            "outcome":{ 
              "network_status":"approved_by_network",
              "reason":null,
              "risk_level":"normal",
              "risk_score":32,
              "seller_message":"Payment complete.",
              "type":"authorized"
            },
            "paid":true,
            "payment_intent":"pi_1FVH25ESypPNvvdYGDo6X9H1",
            "payment_method":"pm_1FVGypESypPNvvdYvzzR22l3",
            "payment_method_details":{ 
              "card":{ 
                "brand":"visa",
                "checks":{ 
                  "address_line1_check":null,
                  "address_postal_code_check":"pass",
                  "cvc_check":"pass"
                },
                "country":"US",
                "exp_month":4,
                "exp_year":2024,
                "fingerprint":"T2uFyKFk6S4ZKA7e",
                "funding":"credit",
                "installments":null,
                "last4":"4242",
                "network":"visa",
                "three_d_secure":null,
                "wallet":null
              },
              "type":"card"
            },
            "receipt_email":null,
            "receipt_number":null,
            "receipt_url":"https://pay.stripe.com/receipts/acct_1DLYH2ESypPNvvdY/ch_1FVH25ESypPNvvdY3B0eW0tv/rcpt_G1JfYes7vE76WUsPtF0HczZR4HPQkHf",
            "refunded":false,
            "refunds":{ 
              "object":"list",
              "data":[ 

              ],
              "has_more":false,
              "total_count":0,
              "url":"/v1/charges/ch_1FVH25ESypPNvvdY3B0eW0tv/refunds"
            },
            "review":null,
            "shipping":null,
            "source":null,
            "source_transfer":null,
            "statement_descriptor":"My trip with deposit",
            "statement_descriptor_suffix":null,
            "status":"succeeded",
            "transfer_data":null,
            "transfer_group":null
          }
        ],
        "has_more":false,
        "total_count":1,
        "url":"/v1/charges?payment_intent=pi_1FVH25ESypPNvvdYGDo6X9H1"
      },
      "client_secret":"[FILTERED]",
      "confirmation_method":"automatic",
      "created":1571488065,
      "currency":"gbp",
      "customer":"cus_G1JcXAGYmhraKp",
      "description":null,
      "invoice":null,
      "last_payment_error":null,
      "livemode":false,
      "metadata":{ 
        "booking_id":"2f2a2255-8b43-4574-9d33-b7f56d624026"
      },
      "next_action":null,
      "on_behalf_of":null,
      "payment_method":"pm_1FVGypESypPNvvdYvzzR22l3",
      "payment_method_options":{ 
        "card":{ 
          "installments":null,
          "request_three_d_secure":"automatic"
        }
      },
      "payment_method_types":[ 
        "card"
      ],
      "receipt_email":null,
      "review":null,
      "setup_future_usage":null,
      "shipping":null,
      "source":null,
      "statement_descriptor":"My trip with deposit",
      "statement_descriptor_suffix":null,
      "status":"succeeded",
      "transfer_data":null,
      "transfer_group":null
    }
  },
  "livemode":false,
  "pending_webhooks":1,
  "request":{ 
    "id":"req_QI3nNLcWzsCyPm",
    "idempotency_key":null
  },
  "type":"payment_intent.succeeded",
  "payment_intent":{ 
    "id":"evt_1FVH26ESypPNvvdYDO0icPV1",
    "object":"event",
    "api_version":"2019-09-09",
    "created":1571488066,
    "data":{ 
      "object":{ 
        "id":"pi_1FVH25ESypPNvvdYGDo6X9H1",
        "object":"payment_intent",
        "amount":90000,
        "amount_capturable":0,
        "amount_received":90000,
        "application":null,
        "application_fee_amount":null,
        "canceled_at":null,
        "cancellation_reason":null,
        "capture_method":"automatic",
        "charges":{ 
          "object":"list",
          "data":[ 
            { 
              "id":"ch_1FVH25ESypPNvvdY3B0eW0tv",
              "object":"charge",
              "amount":90000,
              "amount_refunded":0,
              "application":null,
              "application_fee":null,
              "application_fee_amount":null,
              "balance_transaction":"txn_1FVH26ESypPNvvdY5ToQVPwS",
              "billing_details":{ 
                "address":{ 
                  "city":null,
                  "country":null,
                  "line1":null,
                  "line2":null,
                  "postal_code":"42424",
                  "state":null
                },
                "email":null,
                "name":null,
                "phone":null
              },
              "captured":true,
              "created":1571488065,
              "currency":"gbp",
              "customer":"cus_G1JcXAGYmhraKp",
              "description":null,
              "destination":null,
              "dispute":null,
              "failure_code":null,
              "failure_message":null,
              "fraud_details":{ 

              },
              "invoice":null,
              "livemode":false,
              "metadata":{ 
                "booking_id":"2f2a2255-8b43-4574-9d33-b7f56d624026"
              },
              "on_behalf_of":null,
              "order":null,
              "outcome":{ 
                "network_status":"approved_by_network",
                "reason":null,
                "risk_level":"normal",
                "risk_score":32,
                "seller_message":"Payment complete.",
                "type":"authorized"
              },
              "paid":true,
              "payment_intent":"pi_1FVH25ESypPNvvdYGDo6X9H1",
              "payment_method":"pm_1FVGypESypPNvvdYvzzR22l3",
              "payment_method_details":{ 
                "card":{ 
                  "brand":"visa",
                  "checks":{ 
                    "address_line1_check":null,
                    "address_postal_code_check":"pass",
                    "cvc_check":"pass"
                  },
                  "country":"US",
                  "exp_month":4,
                  "exp_year":2024,
                  "fingerprint":"T2uFyKFk6S4ZKA7e",
                  "funding":"credit",
                  "installments":null,
                  "last4":"4242",
                  "network":"visa",
                  "three_d_secure":null,
                  "wallet":null
                },
                "type":"card"
              },
              "receipt_email":null,
              "receipt_number":null,
              "receipt_url":"https://pay.stripe.com/receipts/acct_1DLYH2ESypPNvvdY/ch_1FVH25ESypPNvvdY3B0eW0tv/rcpt_G1JfYes7vE76WUsPtF0HczZR4HPQkHf",
              "refunded":false,
              "refunds":{ 
                "object":"list",
                "data":[ 

                ],
                "has_more":false,
                "total_count":0,
                "url":"/v1/charges/ch_1FVH25ESypPNvvdY3B0eW0tv/refunds"
              },
              "review":null,
              "shipping":null,
              "source":null,
              "source_transfer":null,
              "statement_descriptor":"My trip with deposit",
              "statement_descriptor_suffix":null,
              "status":"succeeded",
              "transfer_data":null,
              "transfer_group":null
            }
          ],
          "has_more":false,
          "total_count":1,
          "url":"/v1/charges?payment_intent=pi_1FVH25ESypPNvvdYGDo6X9H1"
        },
        "client_secret":"[FILTERED]",
        "confirmation_method":"automatic",
        "created":1571488065,
        "currency":"gbp",
        "customer":"cus_G1JcXAGYmhraKp",
        "description":null,
        "invoice":null,
        "last_payment_error":null,
        "livemode":false,
        "metadata":{ 
          "booking_id":"2f2a2255-8b43-4574-9d33-b7f56d624026"
        },
        "next_action":null,
        "on_behalf_of":null,
        "payment_method":"pm_1FVGypESypPNvvdYvzzR22l3",
        "payment_method_options":{ 
          "card":{ 
            "installments":null,
            "request_three_d_secure":"automatic"
          }
        },
        "payment_method_types":[ 
          "card"
        ],
        "receipt_email":null,
        "review":null,
        "setup_future_usage":null,
        "shipping":null,
        "source":null,
        "statement_descriptor":"My trip with deposit",
        "statement_descriptor_suffix":null,
        "status":"succeeded",
        "transfer_data":null,
        "transfer_group":null
      }
    },
    "livemode":false,
    "pending_webhooks":1,
    "request":{ 
      "id":"req_QI3nNLcWzsCyPm",
      "idempotency_key":null
    },
    "type":"payment_intent.succeeded"
  }
}