spec/fixtures/files/stripe_api/webhooks/payment_intents/unsuccessful_status_amount_payment_failed_with_booking_id.json

{ 
  "id":"evt_1FlQxVESypPNvvdYYzthPjbD",
  "object":"event",
  "api_version":"2019-09-09",
  "created":1575339468,
  "data":{ 
    "object":{ 
      "id":"pi_1FlQxUESypPNvvdYM2c3ClZd",
      "object":"payment_intent",
      "amount":45000,
      "amount_capturable":0,
      "amount_received":0,
      "application":null,
      "application_fee_amount":400,
      "canceled_at":null,
      "cancellation_reason":null,
      "capture_method":"automatic",
      "charges":{ 
        "object":"list",
        "data":[ 
          { 
            "id":"ch_1FlQxUESypPNvvdYb9u8W7sQ",
            "object":"charge",
            "amount":45000,
            "amount_refunded":0,
            "application":null,
            "application_fee":null,
            "application_fee_amount":400,
            "balance_transaction":null,
            "billing_details ":{ 
              "address":{ 
                "city":null,
                "country":null,
                "line1":null,
                "line2":null,
                "postal_code":"42424",
                "state":null
              },
              "email":null,
              "name":null,
              "phone":null
            },
            "captured":false,
            "created":1575339468,
            "currency":"gbp",
            "customer":"cus_GI0wudJsspIj6m",
            "description":null,
            "destination":"acct_1FlGhQHkSXticnj0",
            "dispute":null,
            "disputed":false,
            "failure_code":"authentication_required",
            "failure_message":"Your card was declined. This transaction requires authentication.",
            "fraud_details":{ 

            },
            "invoice":null,
            "livemode":false,
            "metadata":{ 
              "booking_id":"a90ce8e2-9af8-4b79-9035-b48390884565"
            },
            "on_behalf_of":null,
            "order":null,
            "outcome":{ 
              "network_status":"declined_by_network",
              "reason":"authentication_required",
              "risk_level":"normal",
              "risk_score":3,
              "seller_message":"The bank returned the decline code `authentication_required`.",
              "type":"issuer_declined"
            },
            "paid":false,
            "payment_intent":"pi_1FlQxUESypPNvvdYM2c3ClZd",
            "payment_method":"pm_1FlQujESypPNvvdYC84BckFO",
            "payment_method_details":{ 
              "card":{ 
                "brand":"visa",
                "checks":{ 
                  "address_li ne1_check":null,
                  "address_postal_code_check":"pass",
                  "cvc_check":"pass"
                },
                "country":"IE",
                "exp_month":4,
                "exp_year":2024,
                "fingerprint":"oSzsK3ta4KYuzF1d",
                "funding":"credit",
                "installments":null,
                "last4":"3220",
                "network":"visa",
                "three_d_secure":null,
                "wallet":null
              },
              "type":"card"
            },
            "receipt_email":null,
            "receipt_number":null,
            "receipt_url":"https://pay.stripe.com/receipts/acct_1DLYH2ESypPNvvdY/ch_1FlQxUESypPNvvdYb9u8W7sQ/rcpt_GI0zqe7OzvHfkhYy42TE4rHn8JYF3q1",
            "refunded":false,
            "refunds":{ 
              "object":"list",
              "data":[ 

              ],
              "has_more":false,
              "total_count":0,
              "url":"/v1/charges/ch_1FlQxUESypPNvvdYb9u8W7sQ/refunds"
            },
            "review":null,
            "shipping":null,
            "source":null,
            "source_transfer":null,
            "statement_descriptor":"My New Trip _ ____",
            "statement_descriptor_suffix":null,
            "status":"failed",
            "transfer_data":{ 
              "amount":null,
              "destination":"acct_1FlGhQHkSXticnj0"
            },
            "transfer_group":"group_pi_1FlQxUESypPNvvdYM2c3ClZd"
          }
        ],
        "has_more":false,
        "total_count":1,
        "url":"/v1/charges?payment_intent=pi_1FlQxUESypPNvvdYM2c3ClZd"
      },
      "client_secret":"pi_ 1FlQxUESypPNvvdYM2c3ClZd_secret_BAr0sIYmFF9aiG8M3zbwVEOQH",
      "confirmation_method":"automatic",
      "created":1575339468,
      "currency":"gbp",
      "customer":"cus_GI0wudJsspIj6m",
      "description":null,
      "invoice":null,
      "last_payment_error":{ 
        "charge":"ch_1FlQxUESypPNvvdYb9u8W7sQ",
        "code":"authentication_required",
        "decline_code":"authentication_required",
        "doc_url":"https://stripe.com/docs/error-codes/authentication-required",
        "message":"Your card was declined. This transaction requires authentication.",
        "payment_method":{ 
          "id":"pm_1FlQujESypPNvvdYC84BckFO",
          "object":"payment_method",
          "billing_details":{ 
            "address":{ 
              "city":null,
              "country":null,
              "line1":null,
              "line2":null,
              "postal_code":"42424",
              "state":null
            },
            "email":null,
            "name":null,
            "phone":null
          },
          "card":{ 
            "brand":"visa",
            "checks":{ 
              "address_line1_check":null,
              "address_postal_code_check":"pass",
              "cvc_check":"pass"
            },
            "country":"IE",
            "exp_month":4,
            "exp_year":2024,
            "fingerprint":"oSzsK3ta4KYuzF1d",
            "funding":"credit",
            "generated_from":null,
            "last4":"3220",
            "three_d_secure_usage":{ 
              "support ed":true
            },
            "wallet":null
          },
          "created":1575339297,
          "customer":"cus_GI0wudJsspIj6m",
          "livemode":false,
          "metadata":{ 

          },
          "type":"card"
        },
        "type":"card_error"
      },
      "livemode":false,
      "metadata":{ 
        "booking_id":"a90ce8e2-9af8-4b79-9035-b48390884565"
      },
      "next_action":null,
      "on_behalf_of":null,
      "payment_method":null,
      "payment_method_options":{ 
        "card":{ 
          "installments":null,
          "request_three_d_secure":"automatic"
        }
      },
      "payment_method_types":[ 
        "card"
      ],
      "receipt_email":null,
      "review":null,
      "setup_future_usage":null,
      "shipping":null,
      "source":null,
      "statement_descriptor":"My New Trip _ ____",
      "statement_descriptor_suffix":null,
      "status":"requires_payment_method",
      "transfer_data":{ 
        "destination":"acct_1FlGhQHkSXticnj0"
      },
      "transfer_group":null
    }
  },
  "livemode":false,
  "pending_webhooks":1,
  "request":{ 
    "id":"req_h5XPaPyXTt6K7t",
    "idempotency_key":null
  },
  "type":"payment_intent.payment_failed"
}