spec/fixtures/files/stripe_api/webhooks/payment_intents/unsuccessful_status_payment_failed_in_session_payment_intent.json

{
  "id": "evt_1FpvNXESypPNvvdY1wxWRV1U",
  "object": "event",
  "api_version": "2019-09-09",
  "created": 1576409715,
  "data": {
    "object": {
      "id": "pi_1FpvMcESypPNvvdY6K40w074",
      "object": "payment_intent",
      "amount": 100000,
      "amount_capturable": 0,
      "amount_received": 0,
      "application": null,
      "application_fee_amount": 1000,
      "canceled_at": null,
      "cancellation_reason": null,
      "capture_method": "automatic",
      "charges": {
        "object": "list",
        "data": [
        ],
        "has_more": false,
        "total_count": 0,
        "url": "/v1/charges?payment_intent=pi_1FpvMcESypPNvvdY6K40w074"
      },
      "client_secret": "pi_1FpvMcESypPNvvdY6K40w074_secret_LWNyKHL3aaisrSXAV0CAaPkQp",
      "confirmation_method": "automatic",
      "created": 1576409658,
      "currency": "gbp",
      "customer": null,
      "description": null,
      "invoice": null,
      "last_payment_error": {
        "code": "payment_intent_authentication_failure",
        "doc_url": "https://stripe.com/docs/error-codes/payment-intent-authentication-failure",
        "message": "The provided PaymentMethod has failed authentication. You can provide payment_method_data or a new PaymentMethod to attempt to fulfill this PaymentIntent again.",
        "payment_method": {
          "id": "pm_1FpvNRESypPNvvdYKJGRp2gg",
          "object": "payment_method",
          "billing_details": {
            "address": {
              "city": null,
              "country": null,
              "line1": null,
              "line2": null,
              "postal_code": "42424",
              "state": null
            },
            "email": null,
            "name": null,
            "phone": null
          },
          "card": {
            "brand": "visa",
            "checks": {
              "address_line1_check": null,
              "address_postal_code_check": "unchecked",
              "cvc_check": "unchecked"
            },
            "country": "US",
            "exp_month": 4,
            "exp_year": 2024,
            "fingerprint": "i0uUtuMdj1FloahJ",
            "funding": "credit",
            "generated_from": null,
            "last4": "3063",
            "three_d_secure_usage": {
              "supported": true
            },
            "wallet": null
          },
          "created": 1576409709,
          "customer": null,
          "livemode": false,
          "metadata": {
          },
          "type": "card"
        },
        "type": "invalid_request_error"
      },
      "livemode": false,
      "metadata": {
      },
      "next_action": null,
      "on_behalf_of": null,
      "payment_method": null,
      "payment_method_options": {
        "card": {
          "installments": null,
          "request_three_d_secure": "automatic"
        }
      },
      "payment_method_types": [
        "card"
      ],
      "receipt_email": null,
      "review": null,
      "setup_future_usage": "on_session",
      "shipping": null,
      "source": null,
      "statement_descriptor": "My New Trip _ 2019",
      "statement_descriptor_suffix": null,
      "status": "requires_payment_method",
      "transfer_data": {
        "destination": "acct_1FnPc0DgxFUR8eJ5"
      },
      "transfer_group": null
    }
  },
  "livemode": false,
  "pending_webhooks": 1,
  "request": {
    "id": null,
    "idempotency_key": "pi_1FpvMcESypPNvvdY6K40w074-src_1FpvNSESypPNvvdYaBBxfpQp"
  },
  "type": "payment_intent.payment_failed"
}